# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
fusion_mode: bifpn
head_channel: 256

# YOLO11n backbone (保持不变)
backbone: 
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]] # 
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]  # 6
  - [-1, 1, SPPF, [512, 5]] # 7
  - [-1, 2, C2PSA, [512]] # 8

# --- Parallel Feature Refinement Block (保持不变) ---
# YOLO11n SBW-Neck & Head with DSAN_EDFFN
head:
  # --- Stage 1: Top-Down Path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 9
  - [4, 1, Conv, [512, 1, 1]]                   # 10
  - [[9, -1], 1, Fusion, ['fusion_mode']]              # 11
  - [-1, 2, C3k2, [512, False]]      # 12,  

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
  - [2, 1, Conv, [512, 1, 1]]                    # 14
  - [[13, -1], 1, Fusion, ['fusion_mode']]              # 15
  - [-1, 2, C3k2, [256, False]]     # 16, 

  # --- Stage 2: Bottom-Up Path ---
  - [-1, 1, Conv, [256, 3, 2]]                     # 17
  - [12, 1, Conv, [256, 1, 1]]                   # 18
  - [[17, -1], 1, Fusion, ['fusion_mode']]              # 19
  - [-1, 2, C3k2, [512, False]]          # 20,

  - [-1, 1, Conv, [512, 3, 2]]                     # 21
  - [8, 1, Conv, [512, 1, 1]]                   # 22
  - [[21, -1], 1, Fusion, ['fusion_mode']]              # 23
  - [-1, 2, C3k2, [512, False]]           # 24,

  # --- Detect Head ---
  - [[16, 20, 24], 1,Detect, [nc]]                # 28, Detect(P2, P3, P4)